Conf.Simple/src/Catalogs/SUI_НастройкиДокументовОбмена/SUI_НастройкиДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументовОбмена</name>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СинонимМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументОбменаПриЗаписиДокумента1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекОтбораДокументов</name>
    <comment>Настройки компоновки данных содержащие элементы отбора</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекРеквизитовДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиТаблиц</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьНеЗаполненные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеНастроекРеквизитовТаблицы</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработкиСтрокЗагрузкиДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаЗаполнениеРеквизитов</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаСозданиеДокументовНаОсновании</name>
    <attributes>
      <name>ИмяДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработчик</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиИдентификацииСтрок</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументовОбмена/Forms/ФормаНастройкиИдентификацииСтрок/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	КлючСвязи = Параметры.КлючСвязи;
	ВладелецУникальныйИдентификатор = Параметры.УникальныйИдентификатор;
	ИмяМетаданныхДокумента = Параметры.ИмяМетаданныхДокумента;
	ИмяТабличнойЧасти = Параметры.ИмяТабличнойЧасти;
	ТипТаблицы = Параметры.ТипТаблицы;
	Заголовок = Параметры.Заголовок;
	
	ОписаниеРеквизитов = SUI_НастройкиДокументовПовтИсп.ОписаниеРеквизитовДокумента(ИмяМетаданныхДокумента);
	Если ОписаниеРеквизитов <> Неопределено Тогда
		ОписаниеРеквизитов = ОписаниеРеквизитов.Строки.Найти("ТабличныеЧасти", "Имя", Ложь).Строки.Найти(ИмяТабличнойЧасти, "Имя", Ложь);
	КонецЕсли;
	
	Если ОписаниеРеквизитов <> Неопределено Тогда
		
		Для Каждого ОписаниеРеквизита Из ОписаниеРеквизитов.Строки Цикл
			ДоступныеРеквизиты.Добавить(ОписаниеРеквизита.Имя, ОписаниеРеквизита.Представление);
			РеквизитыИдентификации.Добавить(ОписаниеРеквизита.Имя, ОписаниеРеквизита.Представление);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ДоступныеРеквизиты.Количество() = 0 Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для Каждого РеквизитИдентификации Из Параметры.РеквизитыИдентификации Цикл
		
		Если Не ВыбратьРеквизит(РеквизитИдентификации.Значение, ДоступныеРеквизиты, ВыбранныеРеквизиты, Ложь) Тогда
			Модифицированность = Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	ДоступныеРеквизиты.СортироватьПоПредставлению();
	ВыбранныеРеквизиты.СортироватьПоПредставлению();
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранныеРеквизиты.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не выбраны реквизиты идентификации строк'"), , 
			"ВыбранныеРеквизиты", , Отказ);
	ИначеЕсли ВыбранныеРеквизиты.Количество() > 9 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Количество выбранных реквизитов не должно быть более 9'"), , 
			"ВыбранныеРеквизиты", , Отказ);
	Иначе
		
		Для Каждого ВыбранныйРеквизит Из ВыбранныеРеквизиты Цикл
			
			Если РеквизитыИдентификации.НайтиПоЗначению(ВыбранныйРеквизит.Значение) = Неопределено Тогда
				ОбщегоНазначения.СообщитьПользователю(
					СтрШаблон(НСтр("ru = 'Выбранный реквизит %1 не принадлежит объекту %2.%3'"), ВыбранныйРеквизит.Представление, ИмяМетаданныхДокумента, ИмяТабличнойЧасти), , 
					"ВыбранныеРеквизиты", , Отказ);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Отказ Или ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если Модифицированность Тогда
		
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
		
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьРедактированиеПодтверждениеСохранения", ЭтотОбъект);
		ПоказатьВопрос(ОповещениеОЗавершении, НСтр("ru = 'Сохранить изменения?'"), РежимДиалогаВопрос.ДаНетОтмена);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоступныеРеквизиты

&НаКлиенте
Процедура ДоступныеРеквизитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.ДоступныеРеквизиты.ТекущиеДанные <> Неопределено И
		ВыбратьРеквизит(Элементы.ДоступныеРеквизиты.ТекущиеДанные.Значение, ДоступныеРеквизиты, ВыбранныеРеквизиты) Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыбранныеРеквизиты

&НаКлиенте
Процедура ВыбранныеРеквизитыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.ВыбранныеРеквизиты.ТекущиеДанные <> Неопределено И
		УдалитьРеквизит(Элементы.ВыбранныеРеквизиты.ТекущиеДанные.Значение) Тогда
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗавершитьРедактирование(Команда)
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершитьРедактированиеПодтверждениеСохранения", ЭтотОбъект);
	
	ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, КодВозвратаДиалога.Да);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДоступныйРеквизит(Команда)
	
	Если Элементы.ДоступныеРеквизиты.ТекущиеДанные <> Неопределено Тогда
		ВыбратьРеквизит(Элементы.ДоступныеРеквизиты.ТекущиеДанные.Значение, ДоступныеРеквизиты, ВыбранныеРеквизиты);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВыбранныйРеквизит(Команда)
	
	Если Элементы.ВыбранныеРеквизиты.ТекущиеДанные <> Неопределено Тогда
		УдалитьРеквизит(Элементы.ВыбранныеРеквизиты.ТекущиеДанные.Значение);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗавершитьРедактированиеПодтверждениеСохранения(Подтверждение, ДополнительныеПараметры) Экспорт
	
	Если Подтверждение = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	Иначе
		ЗавершитьНастройкуИЗакрыть(Подтверждение = КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьНастройкуИЗакрыть(СРезультатом = Истина)
	
	Результат = Неопределено;
	
	Если СРезультатом Тогда
		
		Если ПроверитьЗаполнение() Тогда
			Результат = СформироватьРезультатНастройки();
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Модифицированность = Ложь;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьРезультатНастройки()
	
	Результат = Новый Структура();
	
	Результат.Вставить("КлючСвязи", 				КлючСвязи);
	Результат.Вставить("РеквизитыИдентификации", 	ВыбранныеРеквизиты.ВыгрузитьЗначения());
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ВыбратьРеквизит(Значение, Источник, Приемник, Сортировать = Истина)
	
	ТекущийДоступныйРеквизит = Источник.НайтиПоЗначению(Значение);
	
	Если ТекущийДоступныйРеквизит = Неопределено Тогда
		Возврат Ложь;
	Иначе
		
		Если Приемник.НайтиПоЗначению(ТекущийДоступныйРеквизит.Значение) <> Неопределено Тогда
			
			Источник.Удалить(ТекущийДоступныйРеквизит);
			
			Если Сортировать Тогда
				Источник.СортироватьПоПредставлению();
			КонецЕсли;
			
		ИначеЕсли Приемник.Количество() < 9 Тогда
			
			Приемник.Добавить(ТекущийДоступныйРеквизит.Значение, ТекущийДоступныйРеквизит.Представление);
			Источник.Удалить(ТекущийДоступныйРеквизит);
			
			Если Сортировать Тогда
				Приемник.СортироватьПоПредставлению();
			КонецЕсли;
			
		Иначе
			#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
				ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Количество выбранных реквизитов не должно быть более 9'"), , "ВыбранныеРеквизиты");
			#Иначе
				ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Количество выбранных реквизитов не должно быть более 9'"), , "ВыбранныеРеквизиты");
			#КонецЕсли
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция УдалитьРеквизит(Значение)
	
	ТекущийВыбранныйРеквизит = ВыбранныеРеквизиты.НайтиПоЗначению(Значение);
	
	Если ТекущийВыбранныйРеквизит = Неопределено Тогда
		Возврат Ложь;
	Иначе
		
		Если ДоступныеРеквизиты.НайтиПоЗначению(ТекущийВыбранныйРеквизит.Значение) = Неопределено Тогда
			ДоступныеРеквизиты.Добавить(ТекущийВыбранныйРеквизит.Значение, ТекущийВыбранныйРеквизит.Представление);
			ДоступныеРеквизиты.СортироватьПоПредставлению();
		КонецЕсли;
		
		ВыбранныеРеквизиты.Удалить(ТекущийВыбранныйРеквизит);
		ВыбранныеРеквизиты.СортироватьПоПредставлению();
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти
